
## Plan Result

[CI link](https://github.com/shimizu-atsuyoshi/live-fire-exercise/actions/runs/18095989651)


<pre><code>Plan: 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.timezone_job_definition.aws_batch_job_definition.this
* Update
  * module.bastion.aws_security_group.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.bastion.aws_security_group.this will be updated in-place
  ~ resource "aws_security_group" "this" {
        id                     = "sg-08e12e4771c3c34ef"
      ~ ingress                = [
          + {
              + cidr_blocks      = []
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
                # (1 unchanged attribute hidden)
            },
        ]
        name                   = "live-fire-exercise-bastion-sg"
        tags                   = {
            "Name" = "live-fire-exercise-bastion-sg"
        }
        # (9 unchanged attributes hidden)
    }

  # module.timezone_job_definition.aws_batch_job_definition.this will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + deregister_on_new_revision = true
      + ecs_properties             = jsonencode(
            {
              + taskProperties = [
                  + {
                      + containers       = [
                          + {
                              + command              = [
                                  + "/opt/timezone/batch",
                                ]
                              + environment          = [
                                  + {
                                      + name  = "TZ"
                                      + value = "Asia/Tokyo"
                                    },
                                ]
                              + image                = "timezone-batch"
                              + logConfiguration     = {
                                  + logDriver = "awslogs"
                                  + options   = {
                                      + awslogs-group         = "/aws/batch/timezone"
                                      + awslogs-region        = "ap-northeast-1"
                                      + awslogs-stream-prefix = "timezone-job"
                                    }
                                }
                              + name                 = "timezone"
                              + resourceRequirements = [
                                  + {
                                      + type  = "VCPU"
                                      + value = "512"
                                    },
                                  + {
                                      + type  = "MEMORY"
                                      + value = "0.25"
                                    },
                                ]
                              + secrets              = []
                            },
                        ]
                      + executionRoleArn = "arn:aws:iam::891377385718:role/timezone-execution-role"
                      + platformVersion  = "LATEST"
                      + taskRoleArn      = "arn:aws:iam::891377385718:role/timezone-task-role"
                    },
                ]
            }
        )
      + id                         = (known after apply)
      + name                       = "timezone"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = false
      + region                     = "ap-northeast-1"
      + revision                   = (known after apply)
      + tags_all                   = (known after apply)
      + type                       = "container"
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"aws-plan","PRNumber":60,"Program":"tfcmt","SHA1":"60bb905abf606eaaf92c06a8a0e49702f7211ee1","Vars":{},"WorkflowName":"aws plan"} -->